{
  "description": "<p><strong>Velvet Smokey Eye Pencil - N 07 - Navy Bleu</strong> is a luxurious eye makeup essential designed to create stunning smokey eye looks with effortless application. This premium eye pencil delivers rich, velvety color with exceptional staying power, making it perfect for both everyday wear and special occasions. 💫</p>\n<h2>Product Information</h2>\n<table border=\"1\" cellpadding=\"5\">\n<tr>\n<th>Size</th>\n<td>Standard Eye Pencil Size</td>\n</tr>\n<tr>\n<th>Color</th>\n<td>N 07 - Navy Bleu (Deep Navy Blue)</td>\n</tr>\n<tr>\n<th>Material</th>\n<td>Creamy Wax-Based Formula</td>\n</tr>\n<tr>\n<th>Brand Name</th>\n<td>Topface</td>\n</tr>\n</table>\n<h3>Key Features of the Velvet Smokey Eye Pencil</h3>\n<ul>\n<li><strong>Intense Pigmentation</strong>: The Navy Bleu shade offers deep, rich color payoff in a single stroke</li>\n<li><strong>Creamy Texture</strong>: Glides on smoothly without tugging or pulling on delicate eyelids</li>\n<li><strong>Smudge-Proof Formula</strong>: Stays in place throughout the day without fading or transferring</li>\n<li><strong>Blendable</strong>: Can be easily smudged for the perfect smokey effect before setting</li>\n<li><strong>Versatile Application</strong>: Works beautifully on both upper and lower lash lines</li>\n</ul>\n<h3>Benefits of Using Velvet Smokey Eye Pencil</h3>\n<p>The <strong>Velvet Smokey Eye Pencil in Navy Bleu</strong> offers a sophisticated alternative to traditional black eyeliner. This deep navy shade enhances all eye colors, particularly making brown and hazel eyes pop with intensity. 🌟 The velvety formula ensures comfortable wear without irritation, perfect for those with sensitive eyes.</p>\n<p>Create everything from subtle definition to dramatic smokey eyes with this versatile pencil. The Navy Bleu shade adds depth and dimension to your eye makeup look while being more forgiving than harsh black, making it ideal for makeup beginners and professionals alike.</p>\n<h4>How to Use Your Velvet Smokey Eye Pencil</h4>\n<p>For a classic look, line your upper lash line with the <strong>Velvet Smokey Eye Pencil</strong>, staying as close to the lashes as possible. For a smokey effect, apply along the lash line and quickly smudge with a brush or fingertip before the formula sets. You can also use it in your waterline for added intensity or as an all-over lid color base for powder eyeshadows.</p>\n<p>Looking for more makeup essentials? Check out our <a href=\"https://xsellpoint.com/product-category/makeup\">complete makeup collection</a> for complementary products to enhance your beauty routine. For more color options, explore our <a href=\"https://xsellpoint.com/product-category/fragrance/gender-international/\">international beauty brands</a> section.</p>\n<h3>Frequently Asked Question</h3>\n<p><strong>How long does the Velvet Smokey Eye Pencil last once applied?</strong><br>\nThe <strong>Velvet Smokey Eye Pencil</strong> is formulated to last up to 8-10 hours without smudging or fading. For maximum longevity, set the pencil with a matching eyeshadow color and use an eye primer beforehand. The waterproof formula ensures it stays put even through humid conditions or light tearing. 💧</p>\n<p>Complete your eye makeup collection with our <a href=\"#\">waterproof mascaras</a>, <a href=\"#\">eyeshadow palettes</a>, or <a href=\"#\">eye makeup removers</a> designed to work perfectly with your new Velvet Smokey Eye Pencil. Experience the difference that premium quality makes in your everyday makeup routine!</p>\n<p>Explore related categories: <a href=\"https://xsellpoint.com/product-category/fragrance/\">Fragrance</a> | <a href=\"https://xsellpoint.com/product-category/fragrance/gender-international/\">Gender International Fragrance</a> | <a href=\"https://xsellpoint.com/product-category/makeup\">Makeup</a></p>",
  "short_description": "<p>Elevate your eye makeup with this velvety-smooth Navy Bleu eye pencil. Creates stunning smokey effects with rich pigmentation and long-lasting wear. Perfect for all eye colors, especially brown and hazel.</p>",
  "slug": "velvet-smokey-eye-pencil-navy-bleu-topface-makeup",
  "meta_data": [
    {
      "key": "rank_math_title",
      "value": "Velvet Smokey Eye Pencil N 07 Navy Bleu - 8-Hour Smudge-Proof Wear"
    },
    {
      "key": "rank_math_description",
      "value": "Discover the luxurious Velvet Smokey Eye Pencil in Navy Bleu with intense pigmentation and creamy application. Create stunning smokey eyes that last all..."
    },
    {
      "key": "rank_math_focus_keyword",
      "value": "Velvet Smokey Eye Pencil, Navy Bleu Eye Pencil, Smokey Eye Makeup"
    },
    {
      "key": "rank_math_keywords",
      "value": "Velvet Smokey Eye Pencil, Navy Bleu Eye Pencil, Smokey Eye Makeup, Topface Eye Pencil, Waterproof Eyeliner"
    }
  ],
  "tags": [
    {
      "name": "Navy Blue Eyeliner"
    },
    {
      "name": "Smudge-Proof Makeup"
    },
    {
      "name": "Smokey Eye Products"
    }
  ]
}