{
  "name": "Skin Editor Matte Eyeliner - Carbon Black - Ultimate 60",
  "description": "<h2>Skin Editor Matte Eyeliner - Carbon Black: Precision Definition for Stunning Eyes</h2>\n<p><strong>Skin Editor Matte Eyeliner - Carbon Black</strong> delivers the ultimate precision and intensity for creating flawless eye looks. This professional-grade eyeliner offers a rich, deep black finish that makes your eyes pop with definition and drama. 💫</p>\n<p>Crafted with a smooth-glide formula, this <strong>Carbon Black eyeliner</strong> applies effortlessly, allowing you to create everything from subtle daytime definition to bold, dramatic evening looks. The ultra-fine tip ensures precise application, making it perfect for creating sharp wings and detailed designs.</p>\n<h3>Superior Formula for Long-Lasting Wear</h3>\n<p>The <strong>Skin Editor Matte Eyeliner</strong> features a quick-drying, smudge-proof formula that stays put for up to 12 hours. Whether you're heading to the office or dancing the night away, this eyeliner won't let you down. The waterproof technology ensures your liner remains flawless through tears, sweat, and humidity. 💦</p>\n<table>\n<tr>\n<th>Product Information</th>\n<th>Details</th>\n</tr>\n<tr>\n<td>Size</td>\n<td>0.01 oz / 0.3g</td>\n</tr>\n<tr>\n<td>Gender</td>\n<td>Unisex</td>\n</tr>\n<tr>\n<td>Product Type</td>\n<td>Matte Eyeliner</td>\n</tr>\n<tr>\n<td>Color</td>\n<td>Carbon Black</td>\n</tr>\n<tr>\n<td>Brand Name</td>\n<td>Skin Editor</td>\n</tr>\n</table>\n<h3>Key Features of Skin Editor Matte Eyeliner</h3>\n<ul>\n<li>Ultra-pigmented <strong>Carbon Black</strong> color for maximum impact</li>\n<li>Smudge-proof and waterproof formula for all-day wear</li>\n<li>Precision tip for detailed application</li>\n<li>Quick-drying matte finish</li>\n<li>Dermatologically tested and suitable for sensitive eyes</li>\n<li>Cruelty-free and vegan-friendly formulation</li>\n</ul>\n<h4>The Perfect Addition to Your Makeup Collection</h4>\n<p>The <strong>Skin Editor Matte Eyeliner - Carbon Black</strong> pairs beautifully with our <a href=\"/products/skin-editor-volumizing-mascara\">Skin Editor Volumizing Mascara</a> for a complete eye look. For a softer daytime alternative, try our <a href=\"/products/skin-editor-brown-eyeliner\">Skin Editor Brown Eyeliner</a>, or create colorful looks with our <a href=\"/products/skin-editor-colored-eyeliners\">Skin Editor Colored Eyeliner Collection</a>.</p>\n<h4>Frequently Asked Question: How do I create the perfect winged eyeliner with Skin Editor Matte Eyeliner?</h4>\n<p>Creating the perfect wing with your <strong>Skin Editor Matte Eyeliner</strong> is simple! Start by drawing a thin line along your lash line from the inner to outer corner. Then, create a small diagonal line extending from your outer corner at the angle you want your wing. Connect the end of this line back to your lash line to form a triangle, and fill it in. The quick-drying formula of our <strong>Carbon Black eyeliner</strong> makes this technique foolproof, even for beginners! 🌟</p>\n<p>Elevate your eye makeup game today with the <strong>Skin Editor Matte Eyeliner - Carbon Black</strong> and discover why makeup enthusiasts everywhere are making this their go-to eyeliner for creating stunning, long-lasting looks.</p>\n<p><img src=\"https://via.placeholder.com/300\" alt=\"Skin Editor Matte Eyeliner -  Carbon Black\" style=\"max-width:100%;\"></p>",
  "short_description": "<p>Achieve precise, intense eye definition with Skin Editor Matte Eyeliner in Carbon Black. This smudge-proof, waterproof formula delivers rich pigmentation and all-day wear with a sleek matte finish.</p>",
  "slug": "skin-editor-matte-eyeliner-carbon-black",
  "meta_data": [
    {
      "key": "rank_math_title",
      "value": "Skin Editor Matte Eyeliner - Carbon Black - Ultimate 60"
    },
    {
      "key": "rank_math_description",
      "value": "Skin Editor Matte Eyeliner -  Carbon Black offers an exclusive, luxurious experience. Shop now for the ultimate aroma that lasts all day! Pe"
    },
    {
      "key": "rank_math_focus_keyword",
      "value": "Skin Editor Matte Eyeliner -  Carbon Black"
    },
    {
      "key": "rank_math_keywords",
      "value": "Skin Editor Matte Eyeliner -  Carbon Black, Skin Editor Matte Eyeliner - Carbon Black, Carbon Black eyeliner"
    }
  ],
  "tags": [
    {
      "name": "eyeliner"
    },
    {
      "name": "matte finish"
    },
    {
      "name": "carbon black"
    },
    {
      "name": "waterproof makeup"
    },
    {
      "name": "smudge-proof"
    },
    {
      "name": "long-lasting makeup"
    },
    {
      "name": "eye makeup"
    },
    {
      "name": "precision liner"
    },
    {
      "name": "vegan makeup"
    },
    {
      "name": "cruelty-free"
    }
  ]
}