{
  "name": "Skin Editor Matte Foundation - N 04: 12-Hour Flawless Coverage for Perfect Skin",
  "description": "<h2>Skin Editor Matte Foundation - N 04: Your Perfect Complexion Solution</h2>\n<p><strong>Skin Editor Matte Foundation - N 04</strong> delivers flawless coverage with a natural matte finish that lasts all day. This premium foundation is specially formulated to control shine while providing medium to full coverage that feels lightweight on your skin. 💫</p>\n<p>The <strong>N 04 shade</strong> is perfectly balanced for medium skin tones with neutral undertones, making it an ideal match for a wide range of complexions. The innovative formula of <strong>Skin Editor Matte Foundation</strong> blends seamlessly into your skin, effectively concealing imperfections without settling into fine lines or pores.</p>\n<h3>Product Information</h3>\n<table border=\"1\" cellpadding=\"5\">\n<tr><th>Size</th><td>30ml / 1.0 fl oz</td></tr>\n<tr><th>Shade</th><td>N 04 (Medium with Neutral Undertones)</td></tr>\n<tr><th>Product Type</th><td>Liquid Foundation</td></tr>\n<tr><th>Finish</th><td>Matte</td></tr>\n<tr><th>Coverage</th><td>Medium to Full (Buildable)</td></tr>\n</table>\n<h3>Key Features of Skin Editor Matte Foundation - N 04</h3>\n<ul>\n<li>Oil-controlling formula that keeps shine at bay for up to 12 hours ⏱️</li>\n<li>Non-comedogenic and dermatologist-tested for sensitive skin</li>\n<li>Enriched with skin-loving ingredients including Vitamin E and Hyaluronic Acid</li>\n<li>Transfer-resistant and long-wearing formula</li>\n<li>Protects with SPF 15 for daily sun protection</li>\n</ul>\n<p>The <strong>Skin Editor Matte Foundation</strong> collection was developed after extensive research into diverse skin tones and textures. The result is a foundation that not only covers but actually improves your skin's appearance over time with continued use.</p>\n<h4>Application Tips for Skin Editor Matte Foundation - N 04</h4>\n<p>For best results, apply with a damp beauty sponge or foundation brush after prepping skin with moisturizer. The formula is buildable, allowing you to customize your coverage from medium to full without looking cakey. Set with a translucent powder for extended wear in humid conditions. 🧴</p>\n<h3>Frequently Asked Question</h3>\n<p><strong>Is Skin Editor Matte Foundation suitable for oily skin?</strong><br>\nYes! <strong>Skin Editor Matte Foundation - N 04</strong> is specifically designed to work exceptionally well for oily and combination skin types. The oil-controlling formula helps absorb excess sebum throughout the day while maintaining a fresh, matte finish without drying out your skin.</p>\n<p>Complete your flawless look with our <a href=\"/makeup/concealer/brightening-concealer\">Brightening Concealer</a>, <a href=\"/makeup/powder/setting-powder-translucent\">Translucent Setting Powder</a>, and <a href=\"/makeup/primer/mattifying-primer\">Mattifying Primer</a> for a truly perfected complexion that lasts from morning to night.</p>\n<p><img src=\"https://via.placeholder.com/300\" alt=\"Skin Editor Matte Foundation - N 04\" style=\"max-width:100%;\"></p>",
  "short_description": "<p>Skin Editor Matte Foundation - N 04 delivers flawless medium-to-full coverage with a natural matte finish. Perfect for medium skin tones with neutral undertones, this oil-controlling formula lasts up to 12 hours while nourishing skin with Vitamin E and Hyaluronic Acid.</p>",
  "slug": "skin-editor-matte-foundation-n-04",
  "meta_data": [
    {
      "key": "rank_math_title",
      "value": "Skin Editor Matte Foundation - N 04: 12-Hour Flawless Coverage for Perfect Skin"
    },
    {
      "key": "rank_math_description",
      "value": "Discover Skin Editor Matte Foundation - N 04, the perfect medium-neutral shade with 12-hour oil control and skin-nourishing ingredients. Shop now for a ..."
    },
    {
      "key": "rank_math_focus_keyword",
      "value": "Skin Editor Matte Foundation - N 04"
    },
    {
      "key": "rank_math_keywords",
      "value": "Skin Editor Matte Foundation - N 04, matte foundation, medium coverage foundation"
    }
  ],
  "tags": [
    {
      "name": "matte foundation"
    },
    {
      "name": "medium coverage"
    },
    {
      "name": "oil control"
    },
    {
      "name": "long-lasting makeup"
    },
    {
      "name": "neutral undertone"
    },
    {
      "name": "foundation for oily skin"
    },
    {
      "name": "buildable coverage"
    },
    {
      "name": "SPF foundation"
    }
  ]
}